{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "neg_res",
    "1": "clothing_advice",
    "2": "walk_query",
    "3": "confused",
    "4": "outing_query",
    "5": "sun_query",
    "6": "small_talk",
    "7": "rain_query",
    "8": "humid_query",
    "9": "greeting",
    "10": "mood_good",
    "11": "mood_bad",
    "12": "farewell",
    "13": "cycle_query",
    "14": "wind_query",
    "15": "agree_query",
    "16": "weather_query",
    "17": "air_query",
    "18": "help",
    "19": "location_specific_weather_query",
    "20": "temp_query"
  },
  "initializer_range": 0.02,
  "label2id": {
    "agree_query": 15,
    "air_query": 17,
    "clothing_advice": 1,
    "confused": 3,
    "cycle_query": 13,
    "farewell": 12,
    "greeting": 9,
    "help": 18,
    "humid_query": 8,
    "location_specific_weather_query": 19,
    "mood_bad": 11,
    "mood_good": 10,
    "neg_res": 0,
    "outing_query": 4,
    "rain_query": 7,
    "small_talk": 6,
    "sun_query": 5,
    "temp_query": 20,
    "walk_query": 2,
    "weather_query": 16,
    "wind_query": 14
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "vocab_size": 30522
}
